[
  {
    "id": "1",
    "title": "How I Started Finding Vulnerabilities Consistently",
    "slug": "how-i-started-finding-vulnerabilities-consistently",
    "content": "# How I Started Finding Vulnerabilities Consistently\n\nIn the beginning of my bug bounty journey, I couldn't find any vulnerabilities. and when I did, they were usually **duplicates**.\n\nBut over time, I focused on improving my mindset and the way I think during testing.\n\nThankfully, today I have a methodology that I follow to test for vulnerabilities like **`IDOR`**, **`access control issues`**, **`business logic flaws`**, and more.\n\nAnd in this blog, I'll walk you through exactly how I approach it.\n\n---\n\n## The First Step\n\nI start by using the website for **at least one hour** to understand:\n\n- what the platform offers\n- what Frameworks it use\n- what functions it has\n\nThis step isn't anything new. anyone testing the vulnerabilities I mentioned above does this.\n\n---\n\n## After That\n\nI create **two accounts** using **two different browsers.** for example, one on **Chrome** and the other on **Safari.** and then I open **Burp Suite**.\n\nThese are the *only* tools I use when testing these vulnerabilities.\n\nI also **disable Burp's active scanners** (an important step) \n\nbecause they consume a lot of RAM and can cause Burp to crash after a short time.\n\n---\n\n## Before I Start Testing\n\n- I collect all the **API endpoints** found in the website's JavaScript files, either **manually** or using **a tool I built myself**.\n- I don't mind sharing the tool.\nIf you need it, contact me on LinkedIn and I'll send it to you.\n\nIn most websites, the endpoint's **path** or **query parameters** give you a clear idea of what it does (in **REST APIs**).\n\nWith **GraphQL**, it's even easier: the **query** or **mutation** is literally named after its function.\n\nI then store all the endpoints in a single text file:\n\n---\n\n## Next Step\n\nI begin testing the website using **Burp** and the **two browsers**.\n\nFor each endpoint, I test for:\n\n- **IDOR**\n- **Broken access control**\n- **Business logic flaws**\n- **Math assignment issues**\n- **Price manipulation**\n\nOnce I finish testing an endpoint, I **mark it** in my file so I don't waste time re-testing it.\n\n---\n\n## Stage One Complete\n\n### Stage Two\n\nLet's say I collected **100 endpoints**.\n\nI often discover that I've only tested around **50**.\n\nSo I look at the remaining untested endpoints, and from their paths or parameters, I try to find where they appear in the application interface.\n\nThis helps me identify **hidden buttons** or **functions** I didn't notice during normal usage.\n\nFor example, if I find **30 new endpoints**, I test them the same way I described earlier. and the chances of finding vulnerabilities in them are much higher.\n\n---\n\n## The Third and Final Stage\n\nBy this point, I usually have about **20 endpoints left**.\n\nThese are often the **juicy** ones:\n\n- endpoints for **premium features**\n- old functions removed from the frontend but still active in the backend\n- rarely used or undocumented features\n\nI take each of these endpoints from my notes and search for them inside the JavaScript files.\n\nI identify:\n\n- the **request method**\n- the **body parameters**\n- and any related logic\n\nBecause I've already tested many endpoints, I now understand the website's structure and parameter patterns very well.\n\n**These endpoints are where I find the most vulnerabilities. and they are rarely duplicates. because most researchers never reach them.**\n\n---\n\n## One of the Most Important Rules in Bug Bounty\n\n**The more you improve your mindset, the more vulnerabilities you will find. and the further you will stay from duplicates.**\n\n---\n\n## Final Thoughts\n\nIt's important in bug bounty to always search in places that others overlook.\n\nBut at the same time, you still need to test the website normally in the beginning.\n\nIn the end, bug bounty is simply about **consistency.** nothing more.\n\n---\n\n## A Final Note\n\nThis approach may not be new to you, but I wanted to share it because it can help many people test websites in a more accurate and effective way.\n\nAnd if you ever need anything, don't hesitate to contact me on LinkedIn.\n\nBest regards.",
    "excerpt": "In the beginning of my bug bounty journey, I couldn't find any vulnerabilities. But over time, I focused on improving my mindset and developed a methodology to test for IDOR, access control issues, business logic flaws, and more.",
    "published": "2025-11-26T00:00:00Z",
    "createdAt": "2025-11-26T14:00:00Z",
    "updatedAt": "2025-11-26T14:00:00Z"
  }
]
